Autodesk.Navisworks.Api.Data.NavisworksConnection
Implementation of DbConnection.

Autodesk.Navisworks.Api.Data.NavisworksConnection.BeginDbTransaction(System.Data.IsolationLevel)
Not implement

Autodesk.Navisworks.Api.Data.NavisworksConnection.ChangeDatabase(System.String)
Not implement

Autodesk.Navisworks.Api.Data.NavisworksConnection.Close
Does nothing, always keep open.

Autodesk.Navisworks.Api.Data.NavisworksConnection.ConnectionString
Not implement

Autodesk.Navisworks.Api.Data.NavisworksConnection.CreateCommand
Create a new NavisworksCommand and associate it with this connection.
Returns: Returns an instantiated NavisworksCommand object already assigned to this connection.

Autodesk.Navisworks.Api.Data.NavisworksConnection.CreateDbCommand
Forwards to the local CreateCommand() function

Autodesk.Navisworks.Api.Data.NavisworksConnection.Database
Not implement

Autodesk.Navisworks.Api.Data.NavisworksConnection.DataSource
Not implement

Autodesk.Navisworks.Api.Data.NavisworksConnection.GetSchema(System.String,System.String[])
Returns schema information for the data source of this connection
using the specified string for the schema name and the specified string array
for the restriction values.
collectionName: Specifies the name of the schema to return. Now only support "INDEXES" and "INDEXCOLUMNS"
restrictionValues: Specifies a set of restriction values for the requested schema.
Returns: A System.Data.DataTable that contains schema information.

Autodesk.Navisworks.Api.Data.NavisworksConnection.Open
Does nothing, connection is automatically opened by DocumentDatabase.

Autodesk.Navisworks.Api.Data.NavisworksConnection.ServerVersion
Not implement

Autodesk.Navisworks.Api.Data.NavisworksConnection.State
Returns the state of the connection